SCENE0_COLOR1	ld a, %01000111 ; цвет
	ld b, 4 ; Количество знакомест по горизонтали
	ld c, 24 ; Количество знакомест по вертикали
	ld hl, #581c ; адрес начала атрибутной области
	jp SetColor

SCENE0_COLOR2	ld a, %01000111 ; цвет
	ld b, 4 ; Количество знакомест по горизонтали
	ld c, 24 ; Количество знакомест по вертикали
	ld hl, #5800 ; адрес начала атрибутной области
	jp SetColor

SCENE0_PLAY	ld b,12 ; количество кубиков в сцене
                ld iy,_s0data
                jp miniballs.PlayCubes                 
_s0data         
	db 0, 32, 00 : dw #4000
	db 0, 32, 5 : dw #4080
	db 0, 32, 10 : dw #4800
	db 0, 32, 15 : dw #4880
	db 0, 32, 20 : dw #5000
	db 0, 32, 25 : dw #5080

	db 0, 32, 55 : dw #401c
	db 0, 32, 50 : dw #409c
	db 0, 32, 45 : dw #481c
	db 0, 32, 40 : dw #489c
	db 0, 32, 35 : dw #501c
	db 0, 32, 30 : dw #509c
